app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function dashboard()
    {
        $session = session();

        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Please log in first.');
        }

        $userModel   = new UserModel();

        $data = [
            'totalUsers'   => $userModel->countAllResults(),
        ];