app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);

        if ($this->request->getMethod() === 'POST') {
            $session   = session();
            $userModel = new UserModel();

            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]',
            ];

            if (!$this->validate($rules)) {
                return view('auth/login', ['validation' => $this->validator]);
            }

            $user = $userModel->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1

    public function dashboard()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('login');
        }

        $session = session();
        $role = $session->get('role');
        $userId = $session->get('userID');

        $db = \Config\Database::connect();
        $userModel = new UserModel();

        $data = ['role' => $role];

        if ($role === 'admin') {
            $data['totalUsers'] = $userModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`